# Вывести цифры от 0 до n

number = 0
n = int(input('Введите n: '))

while number <= n:
    print (number)
    number += 1